Revit 2027 API
ExternalServices.BuiltInExternalServices.PipePressureDropService Property
 The external service which permits registration of an alternate implementation for pipe pressure drop calculation. To use this service, programmers implement a server class that derives from IPipePressureDropServer.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId PipePressureDropService { get; }
Public Shared ReadOnly Property PipePressureDropService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ PipePressureDropService {
	ExternalServiceId^ get ();
}
static member PipePressureDropService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace